esp-cpp/espp/components/esp32-p4-eth/example/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# for ESP-IDF >= v6.0, we have to set this to allow older boards (e.g.
# esp32-p4-eth) to work with the newer ESP-IDF since it's using an older p4
# chip revision
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# Ethernet (internal EMAC + RMII)
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y

CONFIG_FREERTOS_HZ=1000
